; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-4-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-1 - location
	p0-6 - location
	p1-0 - location
	p1-2 - location
	p1-3 - location
	p1-6 - location
	p1-7 - location
	p2-1 - location
	p2-4 - location
	p2-5 - location
	p3-0 - location
	p4-1 - location
	p5-7 - location
	p6-3 - location
	p7-3 - location
	p7-4 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s4)
	(at driver3 s1)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s5)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s3)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s2)
	(at package2 s2)
	(at package3 s7)
	(at package4 s6)
	(at package5 s7)
	(at package6 s3)
	(at package7 s1)
	(at package8 s1)
	(at package9 s2)
	(at package10 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 77)
	(= (time-to-drive s3 s0) 77)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 69)
	(= (time-to-drive s0 s1) 69)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 54)
	(= (time-to-drive s2 s1) 54)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 66)
	(= (time-to-drive s4 s1) 66)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 10)
	(= (time-to-drive s6 s1) 10)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 67)
	(= (time-to-drive s7 s1) 67)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 19)
	(= (time-to-drive s3 s2) 19)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 80)
	(= (time-to-drive s1 s3) 80)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 75)
	(= (time-to-drive s7 s3) 75)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 30)
	(= (time-to-drive s0 s4) 30)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 42)
	(= (time-to-drive s5 s4) 42)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 99)
	(= (time-to-drive s1 s5) 99)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 49)
	(= (time-to-drive s2 s6) 49)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 79)
	(= (time-to-drive s4 s6) 79)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 74)
	(= (time-to-drive s7 s6) 74)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 67)
	(= (time-to-drive s0 s7) 67)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 11)
	(= (time-to-drive s5 s7) 11)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s1)
	(at driver3 s3)
	(at truck3 s7)
	(at truck4 s3)
	(at package1 s5)
	(at package2 s7)
	(at package3 s1)
	(at package4 s4)
	(at package5 s0)
	(at package6 s1)
	(at package7 s4)
	(at package10 s1)
	))

(:metric minimize (+ (* 3 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (walk driver2 s4 p4-1)
   deleted: (at driver2 s4)
   added: (at driver2 p4-1)
   goals met: 2 of 12
2. (load-truck package1 truck1 s2)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 12
3. (load-truck package2 truck1 s2)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 2 of 12
4. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 2 of 12
5. (walk driver3 s1 p1-3)
   deleted: (at driver3 s1)
   added: (at driver3 p1-3)
   goals met: 2 of 12
6. (walk driver2 p4-1 s1)
   deleted: (at driver2 p4-1)
   added: (at driver2 s1)
   goals met: 3 of 12
7. (walk driver3 p1-3 s3)
   deleted: (at driver3 p1-3)
   added: (at driver3 s3)
   goals met: 4 of 12
8. (drive-truck truck1 s2 s1 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 0 to 702
   goals met: 4 of 12
9. (load-truck package7 truck1 s1)
   deleted: (at package7 s1)
   added: (in package7 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 4 of 12
10. (drive-truck truck1 s1 s4 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (fuel-used) from 702 to 1758
   goals met: 4 of 12
11. (unload-truck package7 truck1 s4)
   deleted: (in package7 truck1)
   added: (at package7 s4)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 5 of 12
12. (load-truck package6 truck3 s3)
   deleted: (at package6 s3)
   added: (in package6 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 5 of 12
13. (board-truck driver3 truck3 s3)
   deleted: (at driver3 s3) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 4 of 12
14. (drive-truck truck3 s3 s1 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   changed: (fuel-used) from 1758 to 2638
   goals met: 4 of 12
15. (unload-truck package6 truck3 s1)
   deleted: (in package6 truck3)
   added: (at package6 s1)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 5 of 12
16. (drive-truck truck3 s1 s7 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s7)
   changed: (fuel-used) from 2638 to 3308
   goals met: 6 of 12
17. (drive-truck truck1 s4 s5 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (fuel-used) from 3308 to 3854
   goals met: 6 of 12
18. (load-truck package3 truck3 s7)
   deleted: (at package3 s7)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 6 of 12
19. (load-truck package5 truck3 s7)
   deleted: (at package5 s7)
   added: (in package5 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 6 of 12
20. (unload-truck package1 truck1 s5)
   deleted: (in package1 truck1)
   added: (at package1 s5)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 7 of 12
21. (drive-truck truck1 s5 s7 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s7)
   changed: (fuel-used) from 3854 to 3975
   goals met: 7 of 12
22. (unload-truck package2 truck1 s7)
   deleted: (in package2 truck1)
   added: (at package2 s7)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 8 of 12
23. (drive-truck truck1 s7 s6 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s6)
   changed: (fuel-used) from 3975 to 4715
   goals met: 8 of 12
24. (load-truck package4 truck1 s6)
   deleted: (at package4 s6)
   added: (in package4 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 8 of 12
25. (drive-truck truck3 s7 s1 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s1)
   changed: (fuel-used) from 4715 to 5586
   goals met: 7 of 12
26. (unload-truck package3 truck3 s1)
   deleted: (in package3 truck3)
   added: (at package3 s1)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 8 of 12
27. (drive-truck truck3 s1 s3 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (fuel-used) from 5586 to 6466
   goals met: 8 of 12
28. (disembark-truck driver3 truck3 s3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s3) (empty truck3)
   goals met: 9 of 12
29. (board-truck driver3 truck4 s3)
   deleted: (at driver3 s3) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 8 of 12
30. (unload-truck package5 truck3 s3)
   deleted: (in package5 truck3)
   added: (at package5 s3)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 8 of 12
31. (load-truck package5 truck4 s3)
   deleted: (at package5 s3)
   added: (in package5 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 8 of 12
32. (drive-truck truck4 s3 s0 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   changed: (fuel-used) from 6466 to 7313
   goals met: 7 of 12
33. (walk driver2 s1 p1-3)
   deleted: (at driver2 s1)
   added: (at driver2 p1-3)
   goals met: 6 of 12
34. (drive-truck truck1 s6 s4 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   changed: (fuel-used) from 7313 to 8182
   goals met: 6 of 12
35. (drive-truck truck4 s0 s3 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   changed: (fuel-used) from 8182 to 9029
   goals met: 7 of 12
36. (disembark-truck driver3 truck4 s3)
   deleted: (driving driver3 truck4)
   added: (at driver3 s3) (empty truck4)
   goals met: 8 of 12
37. (board-truck driver3 truck3 s3)
   deleted: (at driver3 s3) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 7 of 12
38. (unload-truck package5 truck4 s3)
   deleted: (in package5 truck4)
   added: (at package5 s3)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 7 of 12
39. (disembark-truck driver3 truck3 s3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s3) (empty truck3)
   goals met: 8 of 12
40. (board-truck driver3 truck4 s3)
   deleted: (at driver3 s3) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 7 of 12
41. (drive-truck truck4 s3 s0 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   changed: (fuel-used) from 9029 to 9799
   goals met: 6 of 12
42. (walk driver2 p1-3 s3)
   deleted: (at driver2 p1-3)
   added: (at driver2 s3)
   goals met: 6 of 12
43. (board-truck driver2 truck3 s3)
   deleted: (at driver2 s3) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 6 of 12
44. (load-truck package5 truck3 s3)
   deleted: (at package5 s3)
   added: (in package5 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 6 of 12
45. (drive-truck truck3 s3 s1 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   changed: (fuel-used) from 9799 to 10679
   goals met: 6 of 12
46. (disembark-truck driver2 truck3 s1)
   deleted: (driving driver2 truck3)
   added: (at driver2 s1) (empty truck3)
   goals met: 7 of 12
47. (unload-truck package5 truck3 s1)
   deleted: (in package5 truck3)
   added: (at package5 s1)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 7 of 12
48. (drive-truck truck1 s4 s0 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (fuel-used) from 10679 to 11009
   goals met: 7 of 12
49. (board-truck driver2 truck3 s1)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 6 of 12
50. (drive-truck truck3 s1 s7 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s7)
   changed: (fuel-used) from 11009 to 11679
   goals met: 7 of 12
51. (drive-truck truck4 s0 s1 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (fuel-used) from 11679 to 12369
   goals met: 7 of 12
52. (load-truck package5 truck4 s1)
   deleted: (at package5 s1)
   added: (in package5 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 7 of 12
53. (drive-truck truck4 s1 s3 driver3)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   changed: (fuel-used) from 12369 to 13249
   goals met: 8 of 12
54. (drive-truck truck3 s7 s1 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s1)
   changed: (fuel-used) from 13249 to 13919
   goals met: 7 of 12
55. (disembark-truck driver2 truck3 s1)
   deleted: (driving driver2 truck3)
   added: (at driver2 s1) (empty truck3)
   goals met: 8 of 12
56. (disembark-truck driver3 truck4 s3)
   deleted: (driving driver3 truck4)
   added: (at driver3 s3) (empty truck4)
   goals met: 9 of 12
57. (drive-truck truck1 s0 s3 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 13919 to 14766
   goals met: 9 of 12
58. (board-truck driver3 truck4 s3)
   deleted: (at driver3 s3) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 8 of 12
59. (drive-truck truck4 s3 s0 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   changed: (fuel-used) from 14766 to 15613
   goals met: 7 of 12
60. (unload-truck package5 truck4 s0)
   deleted: (in package5 truck4)
   added: (at package5 s0)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 8 of 12
61. (drive-truck truck4 s0 s3 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   changed: (fuel-used) from 15613 to 16383
   goals met: 9 of 12
62. (board-truck driver2 truck3 s1)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 8 of 12
63. (unload-truck package4 truck1 s3)
   deleted: (in package4 truck1)
   added: (at package4 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 8 of 12
64. (disembark-truck driver2 truck3 s1)
   deleted: (driving driver2 truck3)
   added: (at driver2 s1) (empty truck3)
   goals met: 9 of 12
65. (drive-truck truck1 s3 s0 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 16383 to 17153
   goals met: 9 of 12
66. (drive-truck truck1 s0 s4 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (fuel-used) from 17153 to 17453
   goals met: 9 of 12
67. (load-truck package4 truck4 s3)
   deleted: (at package4 s3)
   added: (in package4 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 9 of 12
68. (drive-truck truck4 s3 s0 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   changed: (fuel-used) from 17453 to 18300
   goals met: 8 of 12
69. (board-truck driver2 truck3 s1)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 7 of 12
70. (drive-truck truck3 s1 s7 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s7)
   changed: (fuel-used) from 18300 to 18970
   goals met: 8 of 12
71. (drive-truck truck4 s0 s4 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   changed: (fuel-used) from 18970 to 19300
   goals met: 8 of 12
72. (unload-truck package4 truck4 s4)
   deleted: (in package4 truck4)
   added: (at package4 s4)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 9 of 12
73. (disembark-truck driver1 truck1 s4)
   deleted: (driving driver1 truck1)
   added: (at driver1 s4) (empty truck1)
   goals met: 9 of 12
74. (drive-truck truck3 s7 s1 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s1)
   changed: (fuel-used) from 19300 to 19970
   goals met: 8 of 12
75. (disembark-truck driver3 truck4 s4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s4) (empty truck4)
   goals met: 8 of 12
76. (board-truck driver1 truck4 s4)
   deleted: (at driver1 s4) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 8 of 12
77. (drive-truck truck4 s4 s1 driver1)
   deleted: (at truck4 s4)
   added: (at truck4 s1)
   changed: (fuel-used) from 19970 to 20630
   goals met: 8 of 12
78. (drive-truck truck4 s1 s3 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   changed: (fuel-used) from 20630 to 21430
   goals met: 9 of 12
79. (drive-truck truck3 s1 s7 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s7)
   changed: (fuel-used) from 21430 to 22100
   goals met: 10 of 12
80. (walk driver3 s4 p4-1)
   deleted: (at driver3 s4)
   added: (at driver3 p4-1)
   goals met: 10 of 12
81. (disembark-truck driver1 truck4 s3)
   deleted: (driving driver1 truck4)
   added: (at driver1 s3) (empty truck4)
   goals met: 10 of 12
82. (walk driver3 p4-1 s1)
   deleted: (at driver3 p4-1)
   added: (at driver3 s1)
   goals met: 10 of 12
83. (drive-truck truck3 s7 s1 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s1)
   changed: (fuel-used) from 22100 to 22770
   goals met: 9 of 12
84. (disembark-truck driver2 truck3 s1)
   deleted: (driving driver2 truck3)
   added: (at driver2 s1) (empty truck3)
   goals met: 10 of 12
85. (board-truck driver3 truck3 s1)
   deleted: (at driver3 s1) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 10 of 12
86. (drive-truck truck3 s1 s3 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (fuel-used) from 22770 to 23570
   goals met: 10 of 12
87. (disembark-truck driver3 truck3 s3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s3) (empty truck3)
   goals met: 11 of 12
88. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 11 of 12
89. (drive-truck truck3 s3 s7 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s7)
   changed: (fuel-used) from 23570 to 24320
   goals met: 12 of 12
